# Data Visualization
# BTech Computer Science Stream , January 2025
# Week 4 - Pandas Demonstration Notebook
# Sujithra,  Reg Number , Date: 06/01/2025

In [ ]:
# Reading data is also called as data loading
# The term parsing is also sometimes used to describe loading text data and interpreting it as tables and different data types. 
# The focus is on data input and output using pandas

In [1]:
import numpy as np
import pandas as pd

Use notepad and create a .csv file called 'ex1.csv' with the following contents
a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [5]:
# Since this is comma-delimited, we can then use pandas.read_csv to read it into a DataFrame:
df1 = pd.read_csv("ex1.csv")
df1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Create another file 'ex2.csv' with the following contents and no header row
1,2,3,4,first
5,6,7,8,second
9,10,11,12,third

In [9]:
#df2=pd.read_csv("ex2.csv", header=None)
df2=pd.read_csv("ex2.csv", names=["a", "b", "c", "d", "message"])
df2

   a   b   c   d message
0  1   2   3   4   first
1  5   6   7   8  second
2  9  10  11  12   third

Missing data is usually either not present (empty string) or marked by some sentinel (placeholder) value. 
By default, pandas uses a set of commonly occurring sentinels, such as NA and NULL:

Create another file 'ex3.csv' with the following contents
something,a,b,c,d,message
one,1,2,3,4,
two,5,6,,8,world
three,9,10,11,12,foo

In [12]:
# The na_values option accepts a sequence of strings to add to the default list of strings recognized as missing:
df3 = pd.read_csv("ex3.csv")
#df3
#pd.isna(df3)
df3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

Create an excel file called StdMrks.xls with two sheets. 1 sheet contains roll number, name of 5 students with their marks in 5 quizzes (out of 10). The other sheet contains marks obtained in two exams (out of 100 each ) for the same student.

In [14]:
# Reading the file , sheet by sheet
xlsx = pd.ExcelFile("StdMrks.xlsx")

In [15]:
# This object can show you the list of available sheet names in the file and how to parse them 
xlsx.sheet_names

['Sheet1', 'Sheet2']

In [20]:
df_mrks1=xlsx.parse(sheet_name="Sheet1")
df_mrks2=xlsx.parse(sheet_name="Sheet2")

In [19]:
df_mrks1

   Roll Number  Name  Quiz 1  Quiz 2  Quiz 3
0            1   Ram       3       7       7
1            2  Sita       4       8       5
2            3   Abc       6       4       3
3            4  Amit       3       2       2
4            5  Neel       7       5       2

In [21]:
df_mrks2

   Roll Number  Name  Exam 1  Exam 2
0            1   Ram      45      64
1            2  Sita      83      74
2            3   Abc      93      55
3            4  Amit      64      32
4            5  Neel      64      75

In [24]:
# This Excel table has an roll number column, so we can indicate that with the index_col argument:
df_mrks3=xlsx.parse(sheet_name="Sheet1", index_col=0)

In [25]:
df_mrks3

             Name  Quiz 1  Quiz 2  Quiz 3
Roll Number
1             Ram       3       7       7
2            Sita       4       8       5
3             Abc       6       4       3
4            Amit       3       2       2
5            Neel       7       5       2

In [26]:
# f you are reading multiple sheets in a file, then can also simply pass the filename to pandas.read_excel:
frame1 = pd.read_excel("StdMrks.xlsx", sheet_name="Sheet1")
frame1

   Roll Number  Name  Quiz 1  Quiz 2  Quiz 3
0            1   Ram       3       7       7
1            2  Sita       4       8       5
2            3   Abc       6       4       3
3            4  Amit       3       2       2
4            5  Neel       7       5       2

In [28]:
# To write pandas data to Excel format, you must first create an ExcelWriter, then write data to it using the pandas object's to_excel method:
frame1.to_excel("Mrks2.xlsx")